posts/2010-12-03-the-ethical-and-moral-issues-that-face-people-in.org
#+date: <2010-12-03>
#+filetags: quotes ethics
#+title: Ethics Without Borders

#+begin+quote
The ethical and moral issues that face people in the U.S. have a great deal to do with how we see the world, whether we see it as interconnected or not, our responsibility for our neighbors nearby and far away, how we're going to use the resources and the gifts we have to the benefit of somebody beyond our own selves
#+end_quote

--- Episcopal Presiding Bishop Katharine Jefferts Schori, /Chicago Tribune/, December 2, 2010
